In [6]:
import numpy as np
import pandas as pd

ModuleNotFoundError: No module named 'numpy'

In [ ]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [ ]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  1.252699 -0.648647  1.841691 -0.643526
2013-01-02 -0.082888  0.757641  0.101283 -0.157381
2013-01-03 -1.015032  0.579780 -0.235628 -0.576397
2013-01-04 -0.423076  1.203503  1.914999  0.019465
2013-01-05 -0.010607  0.996116 -0.871627 -0.535175
2013-01-06  0.955746 -1.562484 -1.898123  0.854010

In [ ]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [ ]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

SyntaxError: invalid syntax (2915370421.py, line 2)

In [ ]:
df.head()

                   A         B         C         D
2013-01-01  1.252699 -0.648647  1.841691 -0.643526
2013-01-02 -0.082888  0.757641  0.101283 -0.157381
2013-01-03 -1.015032  0.579780 -0.235628 -0.576397
2013-01-04 -0.423076  1.203503  1.914999  0.019465
2013-01-05 -0.010607  0.996116 -0.871627 -0.535175

In [ ]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.423076  1.203503  1.914999  0.019465
2013-01-05 -0.010607  0.996116 -0.871627 -0.535175
2013-01-06  0.955746 -1.562484 -1.898123  0.854010

In [ ]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [ ]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [ ]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [ ]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.112807  0.220985  0.142099 -0.173167
std    0.851189  1.088111  1.507732  0.566980
min   -1.015032 -1.562484 -1.898123 -0.643526
25%   -0.338029 -0.341540 -0.712627 -0.566091
50%   -0.046748  0.668711 -0.067172 -0.346278
75%    0.714157  0.936498  1.406589 -0.024746
max    1.252699  1.203503  1.914999  0.854010

In [ ]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.252699   -0.082888   -1.015032   -0.423076   -0.010607    0.955746
B   -0.648647    0.757641    0.579780    1.203503    0.996116   -1.562484
C    1.841691    0.101283   -0.235628    1.914999   -0.871627   -1.898123
D   -0.643526   -0.157381   -0.576397    0.019465   -0.535175    0.854010

In [ ]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.643526  1.841691 -0.648647  1.252699
2013-01-02 -0.157381  0.101283  0.757641 -0.082888
2013-01-03 -0.576397 -0.235628  0.579780 -1.015032
2013-01-04  0.019465  1.914999  1.203503 -0.423076
2013-01-05 -0.535175 -0.871627  0.996116 -0.010607
2013-01-06  0.854010 -1.898123 -1.562484  0.955746

In [ ]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-06  0.955746 -1.562484 -1.898123  0.854010
2013-01-01  1.252699 -0.648647  1.841691 -0.643526
2013-01-03 -1.015032  0.579780 -0.235628 -0.576397
2013-01-02 -0.082888  0.757641  0.101283 -0.157381
2013-01-05 -0.010607  0.996116 -0.871627 -0.535175
2013-01-04 -0.423076  1.203503  1.914999  0.019465

In [ ]:
df["A"]

2013-01-01    1.252699
2013-01-02   -0.082888
2013-01-03   -1.015032
2013-01-04   -0.423076
2013-01-05   -0.010607
2013-01-06    0.955746
Freq: D, Name: A, dtype: float64

In [ ]:
df[0:3]

                   A         B         C         D
2013-01-01  1.252699 -0.648647  1.841691 -0.643526
2013-01-02 -0.082888  0.757641  0.101283 -0.157381
2013-01-03 -1.015032  0.579780 -0.235628 -0.576397

In [ ]:
df.loc[dates[0]]

A    1.252699
B   -0.648647
C    1.841691
D   -0.643526
Name: 2013-01-01 00:00:00, dtype: float64

In [ ]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  1.252699 -0.648647
2013-01-02 -0.082888  0.757641
2013-01-03 -1.015032  0.579780
2013-01-04 -0.423076  1.203503
2013-01-05 -0.010607  0.996116
2013-01-06  0.955746 -1.562484

In [ ]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.082888  0.757641
2013-01-03 -1.015032  0.579780
2013-01-04 -0.423076  1.203503

In [ ]:
df.loc[dates[0], "A"]

1.252698761400698

In [ ]:
df.at[dates[0], "A"]

1.252698761400698

In [ ]:
df.iloc[3]

A   -0.423076
B    1.203503
C    1.914999
D    0.019465
Name: 2013-01-04 00:00:00, dtype: float64

In [ ]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.423076  1.203503
2013-01-05 -0.010607  0.996116

In [ ]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.082888  0.101283
2013-01-03 -1.015032 -0.235628
2013-01-05 -0.010607 -0.871627

In [ ]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.082888  0.757641  0.101283 -0.157381
2013-01-03 -1.015032  0.579780 -0.235628 -0.576397

In [ ]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.648647  1.841691
2013-01-02  0.757641  0.101283
2013-01-03  0.579780 -0.235628
2013-01-04  1.203503  1.914999
2013-01-05  0.996116 -0.871627
2013-01-06 -1.562484 -1.898123

In [ ]:
df.iloc[1, 1]

0.7576412033650487

In [ ]:
df.iat[1, 1]

0.7576412033650487

In [ ]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  1.252699 -0.648647  1.841691 -0.643526
2013-01-06  0.955746 -1.562484 -1.898123  0.854010

In [ ]:
df[df > 0]

                   A         B         C         D
2013-01-01  1.252699       NaN  1.841691       NaN
2013-01-02       NaN  0.757641  0.101283       NaN
2013-01-03       NaN  0.579780       NaN       NaN
2013-01-04       NaN  1.203503  1.914999  0.019465
2013-01-05       NaN  0.996116       NaN       NaN
2013-01-06  0.955746       NaN       NaN  0.854010